---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.ModelOrSymbolic
source: html/1f3a2dac-a414-c8e7-d188-fae28ce502db.htm
---
# Autodesk.Revit.DB.ParameterTypeId.ModelOrSymbolic Property

"Model or Symbolic"

## Syntax (C#)
```csharp
public static ForgeTypeId ModelOrSymbolic { get; }
```